app/helpers/pokemons_helper.rb

  def get_user_pokemons(trade,user)
    pokemons_json = JSON.parse trade.pokemons_change
    pokemons_id = pokemons_json[user]
    pokemons = Pokemon.where(id: pokemons_id)
    html = '<div class="row">'

    pokemons.each do |pokemon|
---
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" IN ($1, $2)  [[nil, 902], [nil, 910]]