app/views/trade/history.html.erb

        <tr>
          <td><%= User.find_by(id: trade.from_user_id).username %></td>
          <td><%= get_user_pokemons(trade,'from_user') %></td>
          <td><%= User.find_by(id: trade.to_user_id).username %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]