app/views/trade/new.html.erb

      <tr>
      <% range = current_user.pokemons.size > 6 ? current_user.pokemons.size : 6 %>
---
SELECT "pokemons".* FROM "pokemons" INNER JOIN "user_pokemons" ON "pokemons"."id" = "user_pokemons"."pokemon_id" WHERE "user_pokemons"."user_id" = $1  [["user_id", 3]]
SELECT COUNT(*) FROM "pokemons" INNER JOIN "user_pokemons" ON "pokemons"."id" = "user_pokemons"."pokemon_id" WHERE "user_pokemons"."user_id" = $1  [["user_id", 4]]

      <th scope="col"> Usuário </th>
      <% range = User.all.map{|user| user.pokemons.size}.max %>
---
SELECT "pokemons".* FROM "pokemons" INNER JOIN "user_pokemons" ON "pokemons"."id" = "user_pokemons"."pokemon_id" WHERE "user_pokemons"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "pokemons" INNER JOIN "user_pokemons" ON "pokemons"."id" = "user_pokemons"."pokemon_id" WHERE "user_pokemons"."user_id" = $1  [["user_id", 1]]