app/controllers/trade_controller.rb

SELECT 1 AS one FROM "trades" WHERE "trades"."from_user_id" = $1 LIMIT $2  [["from_user_id", 4], ["LIMIT", 1]]
---
  def history
    @trades = Trade.where(from_user_id: current_user.id)
    @trades = Trade.where(to_user_id: current_user.id) if @trades.empty?

INSERT INTO "user_pokemons" ("user_id", "pokemon_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 4], ["pokemon_id", 926], ["created_at", "2021-05-03 16:09:54.542019"], ["updated_at", "2021-05-03 16:09:54.542019"]]
---
  def create
    from_user_pokemons = Pokemon.where(id: params[:pokemon][:from_user])
    to_user_pokemons = Pokemon.where(id: params[:pokemon][:to_user])

    pokemons_change_json = {from_user: from_user_pokemons.pluck(:id), to_user: to_user_pokemons.pluck(:id)}.to_json
    params[:pokemons_change] = pokemons_change_json
    params[:from_user_id] = current_user.id


    @trade = Trade.create(params.permit(:from_user_id, :to_user_id, :pokemons_change))