app/controllers/trade_controller.rb

SELECT "trades".* FROM "trades" WHERE "trades"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def history
    @trades = Trade.where('from_user_id = ? OR to_user_id = ?', current_user.id, current_user.id)

SELECT "users".* FROM "users"
---
  def new
    @users = User.all

SELECT "pokemons"."id" FROM "pokemons" WHERE "pokemons"."id" IN ($1, $2)  [[nil, 902], [nil, 910]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "trades" ("from_user_id", "to_user_id", "pokemons_change", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["from_user_id", 3], ["to_user_id", 1], ["pokemons_change", "{\"from_user\":[905],\"to_user\":[899]}"], ["created_at", "2021-05-03 13:31:21.814146"], ["updated_at", "2021-05-03 13:31:21.814146"]]
---
  def create
    from_user_pokemons = Pokemon.where(id: params[:pokemon][:from_user])
    to_user_pokemons = Pokemon.where(id: params[:pokemon][:to_user])

    pokemons_change_json = {from_user: from_user_pokemons.pluck(:id), to_user: to_user_pokemons.pluck(:id)}.to_json
    params[:pokemons_change] = pokemons_change_json
    params[:from_user_id] = current_user.id


    @trade = Trade.create(params.permit(:from_user_id, :to_user_id, :pokemons_change))

SELECT "trades".* FROM "trades" WHERE "trades"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "pokemons"."id" FROM "pokemons" INNER JOIN "user_pokemons" ON "pokemons"."id" = "user_pokemons"."pokemon_id" WHERE "user_pokemons"."user_id" = $1  [["user_id", 4]]
UPDATE "trades" SET "updated_at" = $1, "changed_pokemons" = $2 WHERE "trades"."id" = $3  [["updated_at", "2021-05-03 16:36:34.358299"], ["changed_pokemons", true], ["id", 8]]
SELECT "trades".* FROM "trades" WHERE "trades"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "pokemons".* FROM "pokemons" INNER JOIN "user_pokemons" ON "pokemons"."id" = "user_pokemons"."pokemon_id" WHERE "user_pokemons"."user_id" = $1  [["user_id", 4]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "trades" SET "accepted" = $1, "updated_at" = $2, "changed_pokemons" = $3 WHERE "trades"."id" = $4  [["accepted", true], ["updated_at", "2021-05-03 16:49:43.559317"], ["changed_pokemons", true], ["id", 9]]
---
  def accepted
    trade = Trade.find_by(id: params[:trade_id])
    pokemons = JSON.parse trade[:pokemons_change]
    from_user_pokemons = User.find_by(id: trade.from_user_id).pokemons.pluck(:id)
    to_user_pokemons = User.find_by(id: trade.to_user_id).pokemons.pluck(:id)

    return trade.update({accepted: false, changed_pokemons: true}) if params[:accepted_flag] == '0'

    new_from_user_pokemons = (from_user_pokemons - pokemons["from_user"]) + pokemons["to_user"]

    new_to_user_pokemons = (to_user_pokemons - pokemons["to_user"]) + pokemons["from_user"]

    current_user.pokemon_ids = new_to_user_pokemons
    User.find_by(id: trade.from_user_id).pokemon_ids = new_from_user_pokemons


    trade.update({accepted: true, changed_pokemons: true})

DELETE FROM "trades" WHERE "trades"."id" = $1  [["id", 10]]
SELECT "trades".* FROM "trades" WHERE "trades"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def cancel
    Trade.find_by(id: params[:trade_id]).destroy