app/controllers/users_controller.rb

  def new
    @user = User.new
    @pokemons = Pokemon.all
---
SELECT "pokemons".* FROM "pokemons"

  def create
    pokemons_ids = params[:pokemon]

    if pokemons_ids.size > 6
      redirect_to new_user_path, flash: {error: 'Você precisa escolher no máximo 6 pokemons'}
    else
      @user = User.create(params.require(:user).permit(:username,
      :password))
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"